In [37]:
import pandas as pd
import numpy as np

In [38]:
people={
    "first":['Missing',"mahesh","sheshnath","NA",np.nan],
    "last":[np.nan,"bhandari","bhandari",np.nan,'NA'],
    "email":["np.nan","ma@gmail.com",None,"su@gmail.com","B@gmail.com"],
    "age":['11','22','33',None,'Missing']
}

In [41]:
df=pd.DataFrame(people)

In [42]:
df

       first      last         email      age
0    Missing       NaN        np.nan       11
1     mahesh  bhandari  ma@gmail.com       22
2  sheshnath  bhandari          None       33
3         NA       NaN  su@gmail.com     None
4        NaN        NA   B@gmail.com  Missing

In [12]:
#TO CUT ALL THE UNNECESSAY VALUES and only rows with all the values display
#WE USE DROPNA

In [43]:
df.dropna()

    first      last         email age
1  mahesh  bhandari  ma@gmail.com  22

In [44]:
#df.dropna is basically 
# df.dropna(axis='index',how='any'),i.e

#  df.dropna ==df.dropna(axis='index',how='any')

In [45]:
df.dropna(axis='index',how='any')

    first      last         email age
1  mahesh  bhandari  ma@gmail.com  22

In [46]:
#for only deleting the rows whose all values are missing we use
#how=all

In [47]:
df.dropna(axis='index',how='all')

       first      last         email      age
0    Missing       NaN        np.nan       11
1     mahesh  bhandari  ma@gmail.com       22
2  sheshnath  bhandari          None       33
3         NA       NaN  su@gmail.com     None
4        NaN        NA   B@gmail.com  Missing

In [48]:
#to see the data where email is presnt 
#we can do it by

In [49]:
df.dropna(axis='index',how='all',subset=['email'])

     first      last         email      age
0  Missing       NaN        np.nan       11
1   mahesh  bhandari  ma@gmail.com       22
3       NA       NaN  su@gmail.com     None
4      NaN        NA   B@gmail.com  Missing

In [50]:
#to see the data where the email or last name is present

In [51]:
df.dropna(axis='index',how='all',subset=['email','last'])

       first      last         email      age
0    Missing       NaN        np.nan       11
1     mahesh  bhandari  ma@gmail.com       22
2  sheshnath  bhandari          None       33
3         NA       NaN  su@gmail.com     None
4        NaN        NA   B@gmail.com  Missing

In [52]:

#DELING WITH THE CUSTOM MISSING VALUES LIKE 'NONE',MISSING'

In [55]:
df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [56]:
df

       first      last         email   age
0        NaN       NaN        np.nan    11
1     mahesh  bhandari  ma@gmail.com    22
2  sheshnath  bhandari          None    33
3        NaN       NaN  su@gmail.com  None
4        NaN       NaN   B@gmail.com   NaN

In [57]:
df.dropna()

    first      last         email age
1  mahesh  bhandari  ma@gmail.com  22

In [58]:
df.isna()
#Returns the results in boolen

   first   last  email    age
0   True   True  False  False
1  False  False  False  False
2  False  False   True  False
3   True   True  False   True
4   True   True  False   True

In [59]:
df.fillna("Missing")
#fillna is use to restore that we have changed before like in the case of missing word.

       first      last         email      age
0    Missing   Missing        np.nan       11
1     mahesh  bhandari  ma@gmail.com       22
2  sheshnath  bhandari       Missing       33
3    Missing   Missing  su@gmail.com  Missing
4    Missing   Missing   B@gmail.com  Missing

In [61]:
df.dtypes
#shows the data type

first    object
last     object
email    object
age      object
dtype: object

In [66]:
#    IMPORTANT NOTE

#   df['age'].mean() returns error because here the value in the age is not int it is string

In [67]:
#    IMPORTANT NOTE AGAIN

#   df['age'].astype(int) returns error because np.nan type is float so we need to changeit into float insted.

In [68]:
type(np.nan)

float

In [69]:
df['age']=df['age'].astype(float)

In [70]:
df['age'].mean()

22.0

In [71]:
df['age'].median()

22.0